{
    "menu": {
        "home": "Home",
        "program": "Programme",
        "competitions": "Competitions",
        "location": "Location",
        "patreons": "Patreons",
        "results": "Results",
        "timetable": "Timetable",
        "plan": "Building plan",
        "competitor-zone": "Competitor Zone"
    },
    "home": {
        "event-info": {
            "status": {
                "ended": "Event is ended",
                "live": "Event is now live!",
                "coming": "Event starts in"
            },
            "time": {
                "days": "Days",
                "hours": "Hours",
                "minutes": "Minutes",
                "seconds": "Seconds"
            },
            "university": {
                "hall": "Sports hall of the",
                "name": "Rzeszów University of Technology"
            },
            "details": "After a short break, one of the best competitions in Poland return to Rzeszów with a bang! This time, in addition to the classic Sumo or LineFollower competitions, we were the first in Poland to prepare a unique category for you - BattleBots! Younger participants will surely like the LEGO competitions, but if someone just wants to look and watch - they will definitely not be bored.",
            "results": "See the results!"
        },
        "event-program": {
            "eventsList": [
                { "id": 1, "name": "Exciting competitions", "description": "Participants will be able to compete in as many as 8 categories, i.e. 15 competitions. The organizers prepared the arenas for the struggle on the tracks for LineFollowers or Sumo fights. The track itself in the LF category will test the programming and construction skills of many robotics. In addition to the standard competitions, the organizers have prepared many surprises. Every constructor, regardless of whether he is just starting his adventure with electronics or is already experienced, will surely find something for himself. There will also be competition dedicated to LEGO® fans.", "icon": "la-trophy" },
                { "id": 2, "name": "For the first time in Poland", "description": "This year's edition is back with a bang. Therefore, the organizers would like to invite everyone to take part in a special competition by RoboLab: Battle Bots! Powerful, remotely controlled deadly machines will fight in a dedicated closed arena. Due to the first such event in Poland, the organizers reduced the requirements of the machines to 30x30 (maximum height 2 meters). We encourage all lovers, students and pupils to try their hand and take part in this amazing fight. There will be cash prizes up for the podium.", "icon": "la-robot" },
                { "id": 3, "name": "The best constructors", "description": "Each edition of ROBO ~ motion brings together many professionals, enthusiasts and scientists in the field of robotics. It is an amazing opportunity to establish new contacts, meet specialists at work or learn the most valuable secrets of technology from people from all over Poland. Come, show your best side and guarantee yourself a bright future!", "icon": "la-wrench" }
            ]
        },
        "competitions": {
            "title": "COMPETITIONS",
            "learn": "LEARN MORE",
            "regulations": "Regulations",
            "categories": [
                { "id": 1, "name": "Battle Bots", "description": "Battle Botsy is certainly the most demanding competition at our competition! In a special arena, remote-controlled robots will fight each other until the end of their breath. There will be a lot going on here!", "icon": "battlebot.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/BattleBots.pdf" },
                { "id": 1, "name": "Freestyle", "description": "In this competition, competitors can put on any project, robot or machine. The structures are assessed by judges and visitors. Each voter completes a questionnaire in which they award points for each project, so it is important that each competitor presents their project in the best possible way.", "icon": "freestyle.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/FreeStyle.pdf" },
                { "id": 3, "name": "Humanoid Sprint", "description": "Humanoid robots are supposed to resemble a human body in appearance and way of movement, therefore each robot in this competition must have one pair of legs and arms (and they certainly cannot have wheels). Here they will race against each other on a straight track. He wins first at the finish line.", "icon": "humanoid_sprint.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/HumanoidSprint.pdf" },
                { "id": 4, "name": "Line Follower", "description": "The goal of the robot in this competition is to cover the route marked by the black line drawn on the board as quickly as possible. The robot must follow the line as accurately as possible, without avoiding or cutting corners.", "icon": "line_follower.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/LineFollower.pdf" },
                { "id": 5, "name": "Micromouse", "description": "The robot's task is to find the fastest path from the starting field to the area consisting of four fields arranged in a square. The robot must be very accurate so that it does not bounce off the walls.", "icon": "micromouse.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/MicroMouse.pdf" },
                { "id": 6, "name": "Onion House", "description": "It is a modified version of the competition known as Ketchup House. We focused on Polish products and flavors, so onions will be the subject of our competition. Because why not? You can come to this competition with independently selected onions.", "icon": "onion_house.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/CebulaHouse.pdf" },
                { "id": 7, "name": "Sumo", "description": "Robots like SUMO players must push the opponent out of a specially prepared ring. Many categories will allow you to easily select the appropriate robot class for your preferences and capabilities.", "icon": "sumo.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/Sumo.pdf" },
                { "id": 8, "name": "LEGO® Tug of War", "description": "This competition is also brand new! Two robots facing each other will compete in tugging the rope. The winner is the one who manages to pull most of the rope to his side. This competition is only intended for robots made of LEGO® bricks.", "icon": "tug_of_war.gif", "linkToRegulation": "https://rzit.smarthost.pl/robomotion/regulations/en/LegoTugOfWar.pdf" }
            ]
        },
        "location": {
            "title": "LOCATION",
            "showOnMap": "Show on map"
        },
        "patreons": {
            "organizer": {
                "title": "ORGANIZER",
                "name": "Scientific Club of Automation and Robotics “ROBO”"
            },
            "title": "PATREONS",
            "question": "Do you want to become a patron? Contact us at kontakt@kneiti.prz.edu.pl"
        },
        "footer": {
            "copyright": "Copyright",
            "designed": "Designed & Developed",
            "developer": "Rafał Nazarko"
        }
    },
    "results": {
        "info": "The results will be shown here"
    },
    "timetable": {
        "table": [
            { "time": "8:00-11:00", "name": "Register" },
            { "time": "11:00-15:00", "name": "Eliminations" },
            { "time": "15:00-18:00", "name": "Final" },
            { "time": "18:00", "name": "Award ceremony" }
        ],
        "info": "The schedule is subject to change. Please keep an eye on this page for the latest information."
    },
    "competitor-zone": {
        "info": "Competitor zone will be open soon!"
    }
}